acledsInc/CH32V003_SPWM_DMA-ST7735_SPI_DMA/User/main.c
/*
********************************* (C) COPYRIGHT *******************************
 * File Name          : main.c
 * Author             : WCH
 * Version            : V1.0.0
 * Date               : 2022/08/08
 * Description        : Main program body.
 ******************************************************************************
 * Copyright (c) 2021 Nanjing Qinheng Microelectronics Co., Ltd.
 * This software (modified or not) and binary are used for WCH MPU
 ******************************************************************************
 */

 #include "debug.h"

///--------------------------------------------------------------|
/// | CH32V003       | ST7735    | Description                   |
//---------------------------------------------------------------|
/// |                | 1 - VDD   | 3V3                           |
/// |                | 2 - GND   | GND                           |
/// | PC4            | 3 - CS    | SPI SS (Chip Select)          |
/// |                | 4 - RESET | 3V3                           |
/// | PC3            | 5 - RS    | DC (Data/Command)             |
/// | PC6 (SPI MOSI) | 6 - SDA   | MOSI (Master Output Slave In) |
/// | PC5 (SPI SCLK) | 7 - SCK   | SCLK (Serial Clock)           |
/// |                | 8 - LED   | 3V3                           |
///--------------------------------------------------------------|

#include "st7735.h"
#include <stdint.h>
#include <stdbool.h>

// Define ST7735
#define ST7735_WIDTH    160
#define ST7735_HEIGHT   128

#define ILI9488_WIDTH    320
#define ILI9488_HEIGHT   480

//--------------------------------------------------------
/* TIM1 CHxCVR register Definition */
//--------------------------------------------------------
#define TIM1_CH1CVR_ADDRESS 0x40012C34  // CCR1 for CH1
#define TIM1_CH2CVR_ADDRESS 0x40012C38  // CCR2 for CH2
#define TIM1_CH3CVR_ADDRESS 0x40012C3C  // CCR3 for CH3
#define TIM1_CH4CVR_ADDRESS 0x40012C40  // CCR4 for CH4

/* Private variables */
// 48MHz /(16 *100 *120 *2) = 120Hz
#define TIM1_PSC    8   // Clock = 6MHz
#define TIM1_ARR    201 // SPWM = 15KHz, Amplitude = 0~200

#define buf_size 124    // Sine Resolution
// Sine amplitude = 0~100 (reference)
u16 sine_tbl[buf_size] = {
      2,  2,  5,  7, 10, 12, 15, 17, 20, 22,
     25, 27, 30, 32, 34, 37, 39, 41, 44, 46,
     48, 50, 52, 54, 57, 59, 61, 63, 65, 67,
     68, 70, 72, 74, 75, 77, 79, 81, 83, 84,
     85, 86, 87, 88, 89, 90, 91, 92, 93, 94,
     95, 96, 96, 97, 97, 98, 99, 99, 99,100,
    100,100,100,100, 99, 99, 99, 98, 97, 97,
     96, 96, 95, 94, 93, 92, 91, 90, 89, 88,
     87, 86, 85, 84, 83, 81, 79, 77, 75, 74,
     72, 70, 68, 67, 65, 63, 61, 59, 57, 54,
     52, 50, 48, 46, 44, 41, 39, 37, 34, 32,
     30, 27, 25, 22, 20, 17, 15, 12, 10,  7,
      5,  2,  2,  0
};

// sine amplitude = 0~200 (feedback)
u16 sine_fdb[buf_size] = {
      2,  2,  5,  7, 10, 12, 15, 17, 20, 22,
     25, 27, 30, 32, 34, 37, 39, 41, 44, 46,
     48, 50, 52, 54, 57, 59, 61, 63, 65, 67,
     68, 70, 72, 74, 75, 77, 79, 81, 83, 84,
     85, 86, 87, 88, 89, 90, 91, 92, 93, 94,
     95, 96, 96, 97, 97, 98, 99, 99, 99,100,
    100,100,100,100, 99, 99, 99, 98, 97, 97,
     96, 96, 95, 94, 93, 92, 91, 90, 89, 88,
     87, 86, 85, 84, 83, 81, 79, 77, 75, 74,
     72, 70, 68, 67, 65, 63, 61, 59, 57, 54,
     52, 50, 48, 46, 44, 41, 39, 37, 34, 32,
     30, 27, 25, 22, 20, 17, 15, 12, 10,  7,
      5,  2,  2,  0
};

//--------------------------------------------------------
// Port of the Sine PWM
//--------------------------------------------------------
// PD2 =CH1 (0~180deg High Side)
// PD0 =CH1N (0~180deg LOw Side)
// PA1 =CH2 (180~360deg High Side)
// PA2 =CH2N (180~360deg LOwh Side)
// PC2 =BRKIN (High for OCP)
// PC1 =LED for DMA Transfer Status
//--------------------------------------------------------

#define DMA_LED GPIO_Pin_1      // PC1
#define TIM1_BKIN GPIO_Pin_2    // PC2

#define TIM1_CH1 GPIO_Pin_2     // PD2
#define TIM1_CH1N GPIO_Pin_0    // PD0

#define TIM1_CH2 GPIO_Pin_1     // PA1
#define TIM1_CH2N GPIO_Pin_2    // PA2

//--------------------------------------------------------
// TIM1 init
// Timer DMA routines: TIM1_CH1(PD2) + TIM1_Dead_Time_Init
// PWM output use DMA to TIM1_CH1(CH1 =PD2, CH1N =PD0)
// (complementary output and dead time)
//--------------------------------------------------------
void TIM1_PWMOut_Init(u16 arr, u16 psc, u16 ccp)
{
    GPIO_InitTypeDef        GPIO_InitStructure = {0};
    TIM_OCInitTypeDef       TIM_OCInitStructure = {0};
    TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure = {0};
    TIM_BDTRInitTypeDef     TIM_BDTRInitStructure = {0};

    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1, ENABLE);

    // DMA LED =PC1, TIM1 BRKIN =PC2
    GPIO_InitStructure.GPIO_Pin = DMA_LED;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOC, &GPIO_InitStructure);
    GPIO_SetBits(GPIOC, DMA_LED);   // DMA_LED =ON

    // TIM1 BRKIN =PC2
    GPIO_InitStructure.GPIO_Pin = TIM1_BKIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOC, &GPIO_InitStructure);

    // CH1N =PD0, CH1 =PD2,
    GPIO_InitStructure.GPIO_Pin = TIM1_CH1N | TIM1_CH1;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOD, &GPIO_InitStructure);

    // TIM1 CH2 =PA1, CH2N =PA2
    GPIO_InitStructure.GPIO_Pin = TIM1_CH2 | TIM1_CH2N;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

    // TIM1 Clock
    TIM_DeInit(TIM1);
    TIM_TimeBaseInitStructure.TIM_Period = arr -1;
    TIM_TimeBaseInitStructure.TIM_Prescaler = psc -1;
    TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;
    TIM_TimeBaseInitStructure.TIM_RepetitionCounter = 0;
    TIM_TimeBaseInit(TIM1, &TIM_TimeBaseInitStructure);

