acledsInc/CH32V003_SPWM_DMA-ST7735_SPI_DMA/User/main.c
    // Sine PWM to CH1, CH1N,
    TIM1_DMA_Init(DMA1_Channel5, (u32)TIM1_CH1CVR_ADDRESS, (u32)sine_fdb, buf_size);
    //TIM1_DMA_Init(DMA1_Channel5, (u32)TIM1_CH2CVR_ADDRESS, (u32)sine_fdb buf_size);

    TIM_DMACmd(TIM1, TIM_DMA_Update, ENABLE);   // Start DMA
    TIM_Cmd(TIM1, ENABLE);  //  Start TIM1
}

//---------------------------------------------------------------------
// White Noise Generator State
//---------------------------------------------------------------------
#define NOISE_BITS      8
#define NOISE_MASK      ((1 << NOISE_BITS) - 1)
#define NOISE_POLY_TAP0 31
#define NOISE_POLY_TAP1 21
#define NOISE_POLY_TAP2 1
#define NOISE_POLY_TAP3 0

uint32_t frame = 0;
uint16_t colors[] =
{
    BLACK, NAVY, DARKGREEN, DARKCYAN, MAROON,
    PURPLE, OLIVE, LIGHTGREY, DARKGREY, BLUE,
    GREEN, CYAN, RED, MAGENTA, YELLOW, WHITE,
    ORANGE, GREENYELLOW, PINK,
};

//---------------------------------------------------------------------
// random byte generator
//---------------------------------------------------------------------
u32 lfsr = 1;

uint8_t rand8(void)
{
    u8  bit;
    u32 new_data;

    for (bit = 0; bit < NOISE_BITS; bit++)
    {
        new_data = ((lfsr >> NOISE_POLY_TAP0) ^ (lfsr >> NOISE_POLY_TAP1) ^ (lfsr >> NOISE_POLY_TAP2) ^
                    (lfsr >> NOISE_POLY_TAP3));
        lfsr     = (lfsr << 1) | (new_data & 1);
    }
    return lfsr & NOISE_MASK;
}

//---------------------------------------------------------------------
// draw random Dot
//---------------------------------------------------------------------
void random_dot()
{
    tft_fill_rect(0, 0, ST7735_WIDTH+1, ST7735_HEIGHT+1, BLACK);

    tft_set_background_color(BLACK);
    tft_set_color(PINK);
    tft_set_cursor(0, 1);
    tft_print("1. Random Dot");
    Delay_Ms(1000);

    frame = 10000;
    while (frame-- >0)
    {
        tft_draw_pixel(rand8() % ST7735_WIDTH, rand8() % ST7735_HEIGHT, colors[rand8() % 19]);
    }
}

//---------------------------------------------------------------------
// Scan H-Line
//---------------------------------------------------------------------
void scan_hline()
{
    tft_fill_rect(0, 0, ST7735_WIDTH, ST7735_HEIGHT, BLACK);

    tft_set_background_color(BLACK);
    tft_set_color(GREEN);
    tft_set_cursor(0, 1);
    tft_print("2. Horizon Line");
    Delay_Ms(1000);

    frame = 20;
    while (frame-- >0)
    {
        for (uint8_t i = 0; i < ST7735_HEIGHT; i++)
        {
            tft_draw_line(0, i, ST7735_WIDTH, i, colors[rand8() % 19]);
        }
    }
}

//---------------------------------------------------------------------
// Scan V-Line
//---------------------------------------------------------------------
void scan_vline()
{
    tft_fill_rect(0, 0, ST7735_WIDTH, ST7735_HEIGHT, BLACK);

    tft_set_background_color(BLACK);
    tft_set_color(ORANGE);
    tft_set_cursor(0, 1);
    tft_print("3. Vertical Line");
    Delay_Ms(1000);

    frame = 20;
    while (frame-- >0)
    {
        for (uint8_t i = 0; i < ST7735_WIDTH; i++)
        {
            tft_draw_line(i, 0, i, ST7735_HEIGHT, colors[rand8() % 19]);
        }
    }
}

//---------------------------------------------------------------------
// Random Line
//---------------------------------------------------------------------
void random_line(void)
{
    tft_fill_rect(0, 0, ST7735_WIDTH, ST7735_HEIGHT, BLACK);

    tft_set_background_color(BLACK);
    tft_set_color(CYAN);
    tft_set_cursor(0, 1);
    tft_print("4. Random Line");
    Delay_Ms(1000);

    frame = 500;
    while (frame-- >0)
    {
        tft_draw_line(rand8() %ST7735_WIDTH, rand8() %ST7735_HEIGHT, rand8() %ST7735_WIDTH, rand8() %ST7735_HEIGHT, colors[rand8() % 19]);
    }
}

//---------------------------------------------------------------------
// Centered Rectangle
//---------------------------------------------------------------------
void center_rect(void)
{
    tft_fill_rect(0, 0, ST7735_WIDTH, ST7735_HEIGHT, BLACK);

    tft_set_background_color(BLACK);
    tft_set_color(YELLOW);
    tft_set_cursor(0, 1);
    tft_print("5. Center Rectangle");
    Delay_Ms(1000);

    frame = 20;
    while (frame-- >0)
    {
        for (uint8_t i = 0; i < 60; i++)
        {
            tft_draw_rect(i, i, ST7735_WIDTH -(i << 1), ST7735_HEIGHT -(i << 1), colors[rand8() %19]);
        }
    }
}

//---------------------------------------------------------------------
// Random Rectangle
//---------------------------------------------------------------------
void random_rect(void)
{
    tft_fill_rect(0, 0, ST7735_WIDTH, ST7735_HEIGHT, BLACK);

    tft_set_background_color(BLACK);
    tft_set_color(MAGENTA);
    tft_set_cursor(0, 1);
    tft_print("6. Random Rectangle");
    Delay_Ms(1000);

    frame = 2000;
    while (frame-- >0)
    {
        tft_draw_rect(rand8() %ST7735_WIDTH, rand8() %ST7735_HEIGHT, 20, 20, colors[rand8() % 19]);
    }
}

//---------------------------------------------------------------------
// Fill Rectangle
//---------------------------------------------------------------------
void fill_rect(void)
{
    tft_fill_rect(0, 0, ST7735_WIDTH, ST7735_HEIGHT, BLACK);

    tft_set_background_color(BLACK);
    tft_set_color(GREENYELLOW);
    tft_set_cursor(0, 1);
    tft_print("7. Fill Rectangle");
    Delay_Ms(500);

    frame = 2000;
    while (frame-- >0)
    {
        tft_fill_rect(rand8() %ST7735_WIDTH, rand8() %ST7735_HEIGHT, 20, 20, colors[rand8() %19]);
    }
}

//---------------------------------------------------------------------
// Move Rectangle
//---------------------------------------------------------------------
void move_rect(void)
{
    tft_fill_rect(0, 0, ST7735_WIDTH, ST7735_HEIGHT, BLACK);

    tft_set_background_color(BLACK);
    tft_set_color(WHITE);
    tft_set_cursor(0, 1);
    tft_print("8. Move Rectangle");
    Delay_Ms(1000);

    frame =260;
    uint8_t x =0, y =0, step_x =1, step_y =1;
    while (frame-- >0)
    {
        uint16_t bg = colors[rand8() % 19];
        tft_fill_rect(x, y, 80, 16, bg);
        tft_set_color(colors[rand8() %19]);

        tft_set_background_color(bg);
        tft_set_cursor(x +5, y +5);
        tft_print("Hello, World");
        Delay_Ms(1);

        x += step_x;
        if (x >= ST7735_WIDTH-80)
        {
            step_x = -step_x;
        }
        y += step_y;
        if (y >= ST7735_HEIGHT)
        {
            step_y = -step_y;
        }
    }
}

