acledsInc/CH32V003_SPWM_DMA-ST7735_SPI_DMA/User/main.c
//---------------------------------------------------------------------
// Display Main Menu at ST7789 (128x160)
//---------------------------------------------------------------------
void disp_MENU(void)
{
    tft_fill_rect(0, 0, ST7735_WIDTH, ST7735_HEIGHT, BLACK);
    tft_set_background_color(BLACK);
    tft_set_color(GREEN);
    tft_set_cursor(0, 1);
    tft_print("CH32V003 ST7735 Demo");

    tft_set_color(WHITE);
    tft_set_cursor(0, 16);
    tft_print("1. Random dot");
    tft_set_cursor(0, 24);
    tft_print("2. Horizon line");
    tft_set_cursor(0, 32);
    tft_print("3. Vertical line");
    tft_set_cursor(0, 40);
    tft_print("4. Random line");
    tft_set_cursor(0, 48);
    tft_print("5. Center Rectangle");
    tft_set_cursor(0, 56);
    tft_print("6. Random Rectangle");
    tft_set_cursor(0, 64);
    tft_print("7. Fill rectangle");
    tft_set_cursor(0, 72);
    tft_print("8. Move Rectangle");
}

//---------------------------------------------------------------------
// Main program.
//---------------------------------------------------------------------
int main(void)
{
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);
    SystemCoreClockUpdate();    // HSI 48MHz
    Delay_Init();

    // all clear AF of GPIO
    GPIO_AFIODeInit();

#if (SDI_PRINT == SDI_PR_OPEN)
    SDI_Printf_Enable();
#else
    USART_Printf_Init(115200);
#endif
    //printf("SystemClk:%d\r\n", SystemCoreClock);
    //printf("ChipID:%08x\r\n", DBGMCU_GetCHIPID() );

    init_SPWM();

    // Init ST7735 TFT LCD
    tft_init();
    Delay_Ms(100);

    // clear screen
    tft_fill_rect(0, 0, ST7735_WIDTH, ST7735_HEIGHT, BLACK);
    // set text color
    tft_set_color(WHITE);
    // set text bg color
    tft_set_background_color(BLACK);

    //demo_LCD();
    disp_MENU();

    init_ADC();
    init_DMA();

    // user interval timer =TIM2 clock =1ms
    TIM2_INT_Init(10000, 48000);   // ARR =10,000ms

    // End of Hardware Setup
    while(1)
    {
        // start user code
        TIM_Cmd(TIM2, ENABLE);
        timer2_flag =0; // reset timer2 flag

        // Dispaly ADC-CH7 (0~1023) and TIM2-CNT (0~9999)
        while(timer2_flag == 0)
        {
            disp_ADC();     // Read ADC binary and decimal display [mV]
            disp_TIM2();    // Display timer2 [ms]

            Delay_Ms(25);   // Display time =25ms
        }

        demo_LCD();     // Display graphic demo
        disp_MENU();    // Clear screen and display main menu
        // end user code
    }
}   // End of main()
//---------------------------------------------------------------------
